cvl_api.log

2026-02-05 16:42:22,045 - CVL REQUEST XML:
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPassword</wsa:Action>
    <wsa:MessageID>urn:uuid:14ac4986-9952-4a57-9b68-589978243b62</wsa:MessageID>
    <wsa:To>https://pancheck.cvlindia.com/CVLRestInquiry.svc</wsa:To>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:GetPassword xmlns:ns0="https://krapancheck.cvlindia.com">
      <ns0:password>********</ns0:password>
      <ns0:passKey>********</ns0:passKey>
    </ns0:GetPassword>
  </soap-env:Body>
</soap-env:Envelope>

2026-02-05 16:42:22,143 - CVL Auth Error: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:42:22,143 - CVL PAN Check Error: CVL Authentication Failed: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:42:57,704 - CVL REQUEST XML:
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPassword</wsa:Action>
    <wsa:MessageID>urn:uuid:af01bddb-167d-43e0-9162-5fd824646d6d</wsa:MessageID>
    <wsa:To>https://pancheck.cvlindia.com/CVLRestInquiry.svc</wsa:To>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:GetPassword xmlns:ns0="https://krapancheck.cvlindia.com">
      <ns0:password>********</ns0:password>
      <ns0:passKey>********</ns0:passKey>
    </ns0:GetPassword>
  </soap-env:Body>
</soap-env:Envelope>

2026-02-05 16:42:57,711 - CVL Auth Error: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:42:57,711 - CVL PAN Check Error: CVL Authentication Failed: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:44:50,546 - CVL PAN Check Error: 'CVLClient' object has no attribute 'wsdl_path'
2026-02-05 16:46:22,367 - CVL PAN Check Error: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:50:08,551 - CVL PAN Check Error: HTTPSConnectionPool(host='pancheck.cvlindia.com', port=443): Max retries exceeded with url: /CVLRestInquiry.svc (Caused by NameResolutionError("HTTPSConnection(host='pancheck.cvlindia.com', port=443): Failed to resolve 'pancheck.cvlindia.com' ([Errno 8] nodename nor servname provided, or not known)"))
2026-02-05 16:51:09,686 - CVL Auth Error: There is no default service defined. This is usually due to missing wsdl:service definitions in the WSDL
2026-02-05 16:51:09,687 - CVL PAN Check Error: CVL Authentication Failed: There is no default service defined. This is usually due to missing wsdl:service definitions in the WSDL
2026-02-05 16:52:33,084 - CVL Auth Error: Service not found
2026-02-05 16:52:33,085 - CVL PAN Check Error: CVL Authentication Failed: Service not found
2026-02-05 16:52:57,329 - CVL Auth Error: Service not found
2026-02-05 16:52:57,330 - CVL PAN Check Error: CVL Authentication Failed: Service not found
2026-02-05 16:53:16,458 - CVL Auth Error: Service not found
2026-02-05 16:53:16,458 - CVL PAN Check Error: CVL Authentication Failed: Service not found
